Saint-Francis-Robotics-Team2367/minibots-2026/firmware/esp32s3-dongle/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
# Waveshare ESP32-S3-LCD-1.47: ESP32-S3R8 + 8 MB Octal PSRAM (see wiki). Enables heap for LVGL + Wi‑Fi.
# After changing defaults: idf.py fullclean && idf.py set-target esp32s3 && idf.py build
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
# App needs >1MB (LVGL + USB); use 1500K factory partition
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=n
CONFIG_TINYUSB_HID_COUNT=1
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=64
